Revit 2024 API
AnalyticalModelSelector.CurveSelector Property
 The portion of the curve to be selected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalyticalCurveSelector CurveSelector { get; set; }
Visual Basic
Public Property CurveSelector As AnalyticalCurveSelector
	Get
	Set
Visual C++
public:
property AnalyticalCurveSelector CurveSelector {
	AnalyticalCurveSelector get ();
	void set (AnalyticalCurveSelector value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace